{
    "1": {
        "PageTitle": "Accounts",
        "1": {
            "Title": "Main Accounts page",
            "Text": "You will arrive at this menu after skipping/finishing the tutorial page for the first time. From here you will be prompted to either sign up or login to proceed."

        },
        "2": {
            "Title": "Sign up",
            "Text": "Allows you to sign up for a new account. You will be prompted for a new username and password. If you would like to see your password while typing, you can press the eye icon and toggle it on/off to enable/disable passwod visibility. If there is an error with the username/password, you will be prompted to enter them again. Otherwise, a message confirming success will be shown. You can choose to go back to the main accounts page or proceed to login"
        },
        "3": {
            "Title": "Login",
            "Text": "Allows you to login to your new account. You will be prompted to enter your username and password. If you would like to see your password while typing, you can press the eye icon and toggle it on/off to enable/disable passwod visibility. If there is an error with the username/password, you will be prompted to enter them again. Upon success you will be taken to the main home page"
        }
    },
    "2": {
        "PageTitle": "Main Home",
        "1": {
            "Title": "Load Saves",
            "Text": "This button takes you to the load saves menu which allows you to bring up previously saved game files to use. You can click on the button corresponding to the save file you want to play with. If you have not yet made a save file, it will show that no save files have been made. You must create a save file first before you can play."
        },
        "2": {
            "Title": "Create Saves",
            "Text": "This button takes you to the create saves menu which allows you to create a new save. You can create a new save file from unused saves by clicking on the save. You have 5 saves at most."
        },
        "3": {
            "Title": "Delete Saves",
            "Text": "This button takes you to the delete save menu which allows you to delete a given save if you have any. You can select saves to delete by clicking on the save."
        },
        "4": {
            "Title": "Logout",
            "Text": "Allows you to logout of the account you are currently using. You will be taken to the accounts page where you can login in again or create a new account."
        },
        "5": {
            "Title": "Delete Account",
            "Text": "Allows you to delete your account. You will be logged out and sent back to the accounts page after deleting your account."
        }
    },
    "3": {
        "PageTitle": "Game Home",
        "1": {
            "Title": "Inventory",
            "Text": "This button takes you to your inventory. In the inventory, you can view all of the characters you have acquired. If you select a character, you will have the option to delete the character from the inventory. If you have no characters, you will be prompted to summon some more. If you run out of space in your inventory, you can choose to release a character or expand your inventory. You can release a character by selecting one from the bottom bar and pressing the release button. This will give you a random reward based on the character's rarity. If you want to increase the inventory's capacity, press the + button on the left of the bottom bar. This will increase inventory by 10 and cost 10000 coins."
        },
        "2": {
            "Title": "Summon",
            "Text": "This button takes you to the summoning area. In the summoning area you can choose to summon more characters to add to your inventory. You can summon 1 or 10 at a time. If you do not have enough inventory space for the summoned character batch, you will not be able to summon anything. When you summon characters, you will be taken to summon results page. Press the back to summon button to return back to the summon page."
        },
        "3": {
            "Title": "Shop",
            "Text": "This button takes you to the shop. In the shop you can by various currencies and other items. Some items will use \"Real money\", which represents real life money being spent."
        },
        "4": {
            "Title": "Roster",
            "Text": "This button takes you to the character roster. In the character roster contains all existing characters in the game. These characters are grouped by type and sorted by rarity in descending order. For each character, you can see if you have obtained it or not. When you obtain a new character, you can claim a reward by clicking on the character icon in the roster. You can also claim all rewards by clicking the claim all rewards button at the top. You can only claim rewards once per character."
        }
    },
    "4": {
        "PageTitle": "Buttons That Are In Multiple Pages",
        "1": {
            "Title": "Save",
            "Text": "Allows you to save your progress to the currently used save file. If you don't press the save button before exiting back to the main homepage, any changes made will be undone."
        },
        "2": {
            "Title": "Tutorial",
            "Text": "Allows you to access the relevant tutorial page for the given menu. You can return back by pressing exit tutorial."
        }
    }
}